cask_args appdir: '/Applications'

# Install Homebrew bundle
tap 'homebrew/bundle'

# Install Homebrew Cask
tap 'caskroom/cask'

# Tap for fonts as Casks
tap 'caskroom/fonts'

brew 'coreutils'
brew 'findutils'
brew 'git'
brew 'gnu-sed', args: ['with-default-names']
brew 'grep', args: ['with-default-names']
brew 'mas'
brew 'nodenv'
brew 'wifi-password'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

#cask '1password'
cask 'android-file-transfer'
cask 'bitbar'
cask 'caffeine'
cask 'calibre'
cask 'colorpicker'
cask 'colorpicker-hex'
cask 'disk-inventory-x'
cask 'firefox'
cask 'flux'
cask 'font-fira-mono'
cask 'google-chrome'
cask 'google-hangouts'
cask 'hyper'
cask 'imageoptim'
cask 'launchrocket'
cask 'macdown'
cask 'noisy'
cask 'paintbrush'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'steam'
cask 'sublime-text2'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

#mas '1Password - Password Manager and Secure Wallet', id: 443987910
#mas 'Joystick Mapper', id: 528183797
#mas 'Lightshot Screenshot', id: 526298438
#mas 'TweetDeck', id: 485812721
