cask_args appdir: '/Applications'

# Tap for drivers as Casks
tap 'homebrew/cask-drivers'

# Tap for fonts as Casks
tap 'homebrew/cask-fonts'

# Command-line

brew 'blueutil'
brew 'coreutils'
brew 'dark-mode'
brew 'diff-so-fancy'
brew 'dnscrypt-proxy'
brew 'duti'
brew 'findutils'
brew 'git'
brew 'gnu-sed'
brew 'grep'
brew 'mas'
brew 'nodenv'
brew 'pyenv'
brew 'rbenv'
brew 'safe-rm'
brew 'shellcheck'
brew 'tmux'
brew 'wget'
brew 'wifi-password'
brew 'yt-dlp'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Apps

cask '1password'
cask 'alacritty'
cask 'android-file-transfer'
cask 'appcleaner'
cask 'balenaetcher'
cask 'bitbar'
cask 'caffeine'
cask 'calibre'
cask 'charles'
cask 'chromium'
cask 'disk-inventory-x'
cask 'firefox'
cask 'flux'
cask 'gas-mask'
cask 'google-chrome'
cask 'imageoptim'
cask 'launchcontrol'
cask 'macdown'
cask 'mactex'
cask 'noisy'
cask 'openemu'
cask 'postman'
cask 'raycast'
cask 'signal'
cask 'sloth'
cask 'spectacle'
cask 'spotify'
cask 'swiftdefaultappsprefpane'
cask 'the-unarchiver'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Drivers

cask 'caldigit-thunderbolt-charging'
cask 'xbox360-controller-driver-unofficial'

# Fonts

cask 'font-fira-mono'

# App Store

mas 'Joystick Mapper', id: 528183797
mas 'Lightshot Screenshot', id: 526298438
mas 'LimeChat', id: 414030210
mas 'NextDNS', id: 1464122853
mas 'Pure Paste', id: 1611378436
mas 'Speediness', id: 1596706466
mas 'System Color Picker', id: 1545870783
