cask_args appdir: '/Applications'

# Install Homebrew bundle
tap 'homebrew/bundle'

# Install Homebrew Cask
tap 'caskroom/cask'

# Tap for drivers as Casks
tap 'caskroom/drivers'

# Tap for fonts as Casks
tap 'caskroom/fonts'

# Command-line

brew 'coreutils'
brew 'dark-mode'
brew 'diff-so-fancy'
brew 'duti'
brew 'findutils', args: ['with-default-names']
brew 'git'
brew 'gnu-sed', args: ['with-default-names']
brew 'grep', args: ['with-default-names']
brew 'hostess'
brew 'mas'
brew 'nodenv'
brew 'openssh'
brew 'safe-rm'
brew 'shellcheck'
brew 'wget'
brew 'wifi-password'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Apps

cask 'android-file-transfer'
cask 'appcleaner'
cask 'bitbar'
cask 'brave'
cask 'caffeine'
cask 'calibre'
cask 'charles'
cask 'colorpicker'
cask 'colorpicker-hex'
cask 'disk-inventory-x'
cask 'exodus'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'hyper'
cask 'imageoptim'
cask 'launchcontrol'
cask 'macdown'
cask 'noisy'
cask 'openemu'
cask 'paintbrush'
cask 'rcdefaultapp'
cask 'signal'
cask 'spectacle'
cask 'spotify'
cask 'steam'
cask 'the-unarchiver'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Drivers

cask 'fitbit-connect'
cask 'xbox360-controller-driver-unofficial'

# Fonts

cask 'font-fira-mono'

# App Store

mas '1Password', id: 443987910
mas 'Joystick Mapper', id: 528183797
mas 'Lightshot Screenshot', id: 526298438
mas 'LimeChat', id: 414030210
mas 'TweetDeck', id: 485812721
